"""
文件: Python re 正则库入门
功能：使用 re.findall 实现文本数字提取、手机号匹配；
知识点：正则基础元字符 \d、字符集 []、数量修饰符 + * {}

\d  代表一个数字0~9
+   前面这个东西至少出现 1 次，多了不限
\.  小数点本身在正则是特殊符号，所以要加`\`转义，代表真正的小数点
?   前面这个东西出现 0 次或者 1 次（小数点可有可无）
*   前面这个东西出现 0 次、1 次或者多次
"""

def re_findall():
    import re

    # 测试用的杂乱文本
    text = """
    订单号:9527,联系电话13800138000,备用15912345678
    金额 199.5 元,编号0086,随机数字 666abc789
    """
    # 1. 提取所有数字（包含小数）
    # \d+ 连续数字；\d+\.?\d* 支持整数+小数
    all_nums = re.findall(r"\d+\.?\d*",text)
    print(f"所有数字{all_nums}")

    # 2. 匹配国内手机号：1开头，第二位3/4/5/6/7/8/9，后面9位数字
    all_phone = re.findall(r"1[2-9]\d{9}",text)
    print(f"所有电话号码{all_phone}")

if __name__ == "__main__":
    re_findall()